Public Member Functions | Friends | List of all members
ACAPI::MEP::v1::DistributionSystem Class Referencefinal
MEP Element Manager
A helper object representing a "distribution system", which is a set of MEP elements sharing the same system category index and MEP domain. (E.g. "hot water pipes" or "cold air ducts") More...
#include <MEPDistributionSystem.hpp>
 Inheritance diagram for ACAPI::MEP::v1::DistributionSystem:
 Public Member Functions
Result< API_AttributeIndex >  | GetSystemCategory () const
Result< Domain >  | GetMEPDomain () const
Result< std::vector< UniqueID > >  | GetElements () const
Result< void >  | TraverseTree (std::function< bool(const DistributionSystemsGraphTreeNode &)> traversalFunction) const
Traverses a distribution system from a graph through a tree layout with a traversal function invoked for each generated node in the tree.
 Public Member Functions inherited from ACAPI::v1::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
 class  | ACAPI::Impl::ObjectCreator
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::v1::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::v1::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
A helper object representing a "distribution system", which is a set of MEP elements sharing the same system category index and MEP domain. (E.g. "hot water pipes" or "cold air ducts")
A DistributionSystem is a lightweight wrapper object for use within the API and does not represent any actual database objects and will thus never be serialized to a pln file. The lifetime of a DistributionSystem object is controlled by the DistributionSystemsGraph object that created it, meaning all functions of DistributionSystem will return an APIERR_DELETED error after the owning DistributionSystemsGraph object has gone out of scope.
Since
Archicad 28
Member Function Documentation
◆ GetElements()
 Result< std::vector< UniqueID > > ACAPI::MEP::v1::DistributionSystem::GetElements  |  ( |   | ) |   const
Returns
Returns IDs of the element contained by this distribution system
◆ GetMEPDomain()
 Result< Domain > ACAPI::MEP::v1::DistributionSystem::GetMEPDomain  |  ( |   | ) |   const
Returns
Returns the MEP domain this distribution system belongs to
◆ GetSystemCategory()
 Result< API_AttributeIndex > ACAPI::MEP::v1::DistributionSystem::GetSystemCategory  |  ( |   | ) |   const
Returns
Returns the system category this distribution system belongs to
◆ TraverseTree()
 Result< void > ACAPI::MEP::v1::DistributionSystem::TraverseTree  |  ( |  std::function< bool(const DistributionSystemsGraphTreeNode &)>  |  traversalFunction | ) |   const
Traverses a distribution system from a graph through a tree layout with a traversal function invoked for each generated node in the tree.
Traversal is done in a depth first search (DFS) pattern starting with a root node defined by the system itself.
Parameters
traversalFunction | A callable that will be invoked once per tree node. Return false in callable to exit traversal early.
Returns
Returns an Error if the distribution system does not belong to a DistributionSystemsGraph instance or if traversal failed, otherwise nothing
 GSErrCode traversalError { NoError };
 ACAPI::Result<void, ACAPI::Error> result = system.TraverseTree ([&] (const ACAPI::MEP::DistributionSystemsGraphTreeNode& node) -> bool {
 const ACAPI::Result<Element> mepElement = Element::Get (node.GetElement ());
 // If the element is invalid, continue traversal.
 if (mepElement.IsErr ())
 return true;
 std::string connectedFrom;
 if (node.GetPreviousElement ().has_value ())
 connectedFrom = std::to_string (idToIndex[*node.GetPreviousElement ()]);
 else
 connectedFrom = "No connection";
 std::string connectedTo;
 if (node.GetNextElements ().size () == 0)
 connectedTo = "No connections";
 else {
 for (const auto nextElement : node.GetNextElements ()) {
 if (!connectedTo.empty ())
 connectedTo += ", ";
 connectedTo += std::to_string (idToIndex[nextElement]);
 }
 }
 API_Element textElement = {};
 textElement.header.type = API_TextID;
 API_ElementMemo textMemo;
 traversalError = ACAPI_Element_GetDefaults (&textElement, &textMemo);
 if (traversalError != NoError)
 return false;
 textElement.text.size = 0.5;
 textElement.text.loc.x = mepElement->GetAnchorPoint ().x;
 textElement.text.loc.y = mepElement->GetAnchorPoint ().y;
 textElement.text.multiStyle = false;
 textMemo.textContent = new GS::UniString { GS::UniString::SPrintf ("%llu:\nConnectedFrom: %s\nConnectedTo: %s", idToIndex[node.GetElement ()], connectedFrom.c_str (), connectedTo.c_str ()) };
 traversalError = ACAPI_Element_Create (&textElement, &textMemo);
 if (traversalError == NoError)
 traversalError = ACAPI_DisposeElemMemoHdls (&textMemo);
 // Don't continue traversal if we've encountered an error
 if (traversalError != NoError)
 return false;
 return true;
 });